Tekla Open API Reference for Tekla Structures 2025
Symbol.Hideable Property
 Accesses the information if this object is hidden or not or if it should be.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Hideable Hideable { get; }
Public ReadOnly Property Hideable As Hideable
	Get
Property Value
Type: Hideable
Implements
IHideable.Hideable
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace